app/controllers/my_models_controller.rb

    def create
      my_model = MyModel.new(my_model_params)

      if my_model.save
---
INSERT INTO "my_models" ("name", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "value1"], ["data", "value2"], ["created_at", "2023-07-02 13:57:45.786774"], ["updated_at", "2023-07-02 13:57:45.786774"]]